/*
    Задание:

    Необходимо составить 4 функции калькулятора: сложение, вычитание, умножение и деление.
    Учтите, что для любой операции первым операндом всегда является Value1, вторым - Value2.
    Вводимые данные являются заведомо верными.

    Примеры
    1. Сложение
    Входные данные: 1 0
    Выходные данные: 1

    2. Вычитание
    Входные данные: -1 1
    Выходные данные: 0

    3. Умножение
    Входные данные: 10 10
    Выходные данные: 100

    4. Сложение
    Входные данные: 10 4
    Выходные данные: 2.5

*/

public class Task1 {
    public int Add(int value1, int value2)
    {
        //Напишите свой код
        return 0;
    }

    public int Sub(int value1, int value2)
    {
        //Напишите свой код
        return 0;
    }

    public int Multiply(int value1, int value2)
    {
        //Напишите свой код
        return 0;
    }

    public int Divide(int value1, int value2)
    {
        //Напишите свой код
        return 0;
    }
}
