/*
    Задание:
    Определить, является ли дробь P/Q сократимой.
    Если дробь сократима, то необходимо вывести "Yes", иначе вывести "No".
    Учтите, что вводимые числа больше нуля.
    Вводимые данные являются заведомо верными.

    Примеры
    1.
    Входные данные: 5 3
    Выходные данные: No

    2.
    Входные данные: 0 10
    Выходные данные: Yes
*/

public class Task2 {

    public String CanBeReduced(double value1, double value2)
    {
        //Напишите свой код
        return null;
    }
}
